{"sightings":[{"text":"Witnessed an orange, slow moving light. Was looking out my window and saw a orange colored, non blinking light floating across the night sky. Woke up my daughters to confirm what I was seeing. The object did not blink, was definitely not a helicopter. Very bright orange and moved slowly for about 2 minutes, disappeared behind the trees and did not see it again. Never seen anything like this in my life.","date_time":"10/2/19 22:00","city":"Black Mountain","state":"NC","shape":"Fireball","duration":"2 minutes","summary":"Witnessed an orange, slow moving light. Was looking out my window and saw a orange colored, non blinking light floating across the nigh"},{"city":"Marin County ","state":"CA ","shape":"Cubes","duration":"3 minutes ","date_time":"10/2/19 22:00 ","summary":"Glowing lights in formation  just south of San Quentin ","text":"Glowing lights in formation  just south of San Quentin I witnessed 10 or 11 spherical glowing objects in formation swarming and hovering near the top of Ring Mtn. -Corte Madera.  I very quickly ran up to 2 firemen emergency responders to ask them to quote \"take a quick glance at what is going on over here\".  They flat out refused to take 5 steps over to the side to look at what I was trying to show them.  They were handling some kind of a medical emergency, but it would have been really nice to have them witness this because this was highlight of the whole night."},{"city":"Kecksburg ","state":"Pennsylvania ","shape":"Ball    ","duration":"3 minutes      ","date_time":"10/2/19 22:00      ","summary":"A large, brilliant fireball was seen by thousands  ","text":"Kecksburg UFO incident of Kecksburg, Pennsylvania, occurred on December 9, 1965. A large, brilliant fireball was seen by thousands in at least six states and Ontario, Canada. It streaked over the Detroit, Michigan and Windsor, Ontario area, dropped reported metal debris over Michigan and northern Ohio, and caused sonic booms in western Pennsylvania. It was generally assumed and reported by the press to be a meteor.","updated_date":"20/10/2020","updated_time":"10:56:02"},{"city":"Valensole","state":"France","shape":"Sphere","duration":"3 minutes","date_time":"01/07/1965","summary":"Peasant Maurice Massé saw a landed spherical object and was paralyzed by two grey alien-like occupants.","text":"An alleged UFO sighting and close encounter by farmer Maurice Masse. According to Masse, he encountered two small beings near a spherical vehicle that had landed in a nearby field. Masse claims that he was paralyzed when one of the beings pointed a tube-like object towards him. Masse said he watched the beings looking at plants and making grunting sounds until they returned to the vehicle and flew away. According to his wife, Masse said he received some kind of communication from the beings, considered his encounter \"a spiritual experience\", and looked upon the site as \"hallowed ground\" that \"should be kept in his family forever\"","updated_date":"19/10/2020","updated_time":"11:36:00","created_date":"19/10/2020","created_time":"11:33:00"},{"city":"Bahía Blanca","state":"Argentina","shape":"railroad ","duration":"5 minutes","date_time":"12/04/1962","text":"On 12 May 1962 three truckmen, Valentino Tomassini, Gauro Tomassini and Humberto Zenobi were travelling on Route 35 from Bahia Blanca to Jacinto Aráuz. At 4,10 they saw an object on the ground in a field next to the road at a distance of 100 metres. The object looked like a railroad car and was illuminated. As their truck came close to it, the object rose up and crossed the road at a height of four metres; its lights went out and from the lower part of it came a reddish flame. At last, the object divided into two parts, which flew off in different directions.[1][2]","summary":"Saw an object on the ground in a field next to the road "},{"city":"Ängelholm","state":"Sweden","shape":"Saucer","duration":"3 minutes","date_time":"18/05/1946","text":"It is said to have taken place on 18 May 1946 and to have been seen by the Swedish entrepreneur, founder and owner of Cernelle AB, Gösta Carlsson","summary":"Gösta Karlsson reports seeing a flying saucer and its alien passengers. A model of it is now erected at the site."},{"city":"Puget Sound","state":"Washington","shape":"Doughnut","duration":"5 minutes","date_time":"21/06/1947 23:06","text":"Crisman and Dahl claimed to Arnold that they were harbor patrolmen on a workboat near Maury Island and that they saw six doughnut-shaped objects in the sky. According to Crisman and Dahl, one of the objects dropped a substance that resembled lava or \"white metal\" onto their boat, breaking a worker's arm and killing a dog. Dahl also claimed he was later approached by a man in a dark suit and told not to talk about the incident.","summary":" Harold A. Dahl reported that his dog was killed and his son was injured by debris in an encounter with four to six flying doughnut-shaped objects. He also claimed that a witness was subsequently threatened by the Men in Black."},{"city":"Akron","state":"Ohio","shape":"Disc","duration":"30 minutes","date_time":"17/04/1966 21:30:15","text":"The so-called Portage County UFO Chase was an unidentified flying object encounter that began in Portage County, Ohio on the morning of April 17, 1966, when police officers Dale Spaur and Wilbur Neff observed a metallic, disc shaped object flying in the skies. They pursued the object for about half an hour, ending up in Pennsylvania before losing sight of the UFO. Several other police officers became involved in the chase, and several civilians reported witnessing the same, or a similar object in about the same area, during this time.","summary":"Portage County UFO chase","created_date":"20/10/2020","created_time":"12:05:05"}]}